brew "ack"
brew "cloc"
brew "fzf"
brew "git"
brew "gh"
brew "jq"
brew "vim"
brew "wget"
brew "watch"

# trying out
brew "bat"
brew "diff-so-fancy"
brew "dog"
brew "rm-improved"
brew "scc"
brew "tldr"