# Development Tools
brew "git"         # distributed version control system
brew "gh"          # GitHub's official command line tool
brew "lazygit"     # simple terminal UI for git commands
brew "node"        # JavaScript runtime built on V8
brew "pnpm"        # fast, disk space efficient package manager
brew "python"      # interpreted, interactive, object-oriented programming language
brew "rust"        # fast and memory-efficient language

# CLI Utilities
brew "bat"         # cat clone with syntax highlighting and Git integration
brew "eza"         # modern ls replacement with icons and git integration
brew "fd"          # simple, fast alternative to find
brew "fzf"         # command-line fuzzy finder
brew "ripgrep"     # ultra-fast grep with smart defaults
brew "jq"          # lightweight JSON processor
brew "tldr"        # simplified man pages with practical examples
brew "watch"       # execute a command periodically
brew "zoxide"      # smarter cd command that learns your habits

# Network Tools
brew "curlie"      # curl with the ease of httpie
brew "doggo"       # command-line DNS client like dig
brew "wget"        # retrieve files from the web

# Media Tools
brew "ffmpeg"      # record, convert and stream audio/video
brew "exiftool"    # read and write EXIF metadata
brew "imagemagick" # create, edit, compose, or convert bitmap images
brew "libicns"     # library and tools for manipulating Mac OS icns files
brew "yt-dlp"      # download videos from YouTube and other sites

# Development Utilities
brew "tokei"       # fast code statistics with pretty output

# Shell
brew "starship"    # minimal, blazing-fast shell prompt
brew "zsh"         # extended Bourne shell with many improvements

# Fonts
cask "font-caskaydia-cove-nerd-font"   # Microsoft's modern terminal font with icons
cask "font-fira-code-nerd-font"        # monospaced font with programming ligatures and icons
cask "font-jetbrains-mono-nerd-font"   # JetBrains IDE font with ligatures and icons
cask "font-zed-mono-nerd-font"         # Zed editor font with icons
