brew "ack"
brew "bat"
brew "cloc"
brew "deno"
brew "diff-so-fancy"
brew "curlie"
brew "dog"
brew "exiftool"
brew "fd"
brew "fzf"
brew "git"
brew "gh"
brew "jq"
brew "node"
brew "pnpm"
brew "rm-improved"
brew "scc"
brew "tldr"
brew "wget"
brew "watch"
brew "zoxide"