# Development Tools
brew "cloc"        # code statistics
brew "git"         # distributed version control system
brew "go"          # programming language with built-in concurrency
brew "gh"          # GitHub's official command line tool
brew "just"        # command runner for project-specific tasks
brew "lazygit"     # simple terminal UI for git commands
brew "node"        # JavaScript runtime built on V8
brew "pnpm"        # fast, disk space efficient package manager
brew "python"      # interpreted, interactive, object-oriented programming language
brew "rustup"      # Rust toolchain installer
cask "temurin"     # Eclipse Temurin OpenJDK (latest)
brew "uv"          # extremely fast Python package manager and resolver
brew "vite"        # next generation frontend tooling

# Shell
brew "atuin"       # magical shell history database with sync
brew "eza"         # modern ls replacement with icons and git integration
brew "starship"    # minimal, blazing-fast shell prompt
brew "zellij"      # modern terminal multiplexer written in Rust
brew "zoxide"      # smarter cd command that learns your habits
brew "zsh"         # extended Bourne shell with many improvements

# CLI Utilities
brew "bat"         # cat clone with syntax highlighting and Git integration
brew "fd"          # simple, fast alternative to find
brew "ripgrep"     # ultra-fast grep with smart defaults
brew "jq"          # lightweight JSON processor
brew "watch"       # execute a command periodically

# Cloud Tools
tap "auth0/auth0-cli"
brew "auth0"                  # Auth0 command-line interface
brew "aws-cdk"                # AWS Cloud Development Kit for infrastructure as code
brew "awscli"                 # official AWS command-line interface
brew "awscurl"                # curl wrapper for AWS API calls with sigv4
brew "awslogs"                # query and stream CloudWatch logs
cask "gcloud-cli"             # Google Cloud Platform command-line interface
brew "helm"                   # Kubernetes package manager
cask "session-manager-plugin" # AWS Systems Manager Session Manager plugin
brew "terraform"              # infrastructure as code tool for cloud provisioning


# Network Tools
brew "bind"        # includes dig, nslookup, and other DNS utilities
brew "curlie"      # curl with the ease of httpie
brew "doggo"       # command-line DNS client like dig
brew "wget"        # retrieve files from the web

# Media Tools
brew "ffmpeg"      # record, convert and stream audio/video
brew "exiftool"    # read and write EXIF metadata
brew "imagemagick" # create, edit, compose, or convert bitmap images
brew "libicns"     # library and tools for manipulating Mac OS icns files
brew "yt-dlp"      # download videos from YouTube and other sites

# Fonts
cask "font-caskaydia-cove-nerd-font"   # Microsoft's modern terminal font with icons
cask "font-fira-code-nerd-font"        # monospaced font with programming ligatures and icons
cask "font-jetbrains-mono-nerd-font"   # JetBrains IDE font with ligatures and icons
cask "font-zed-mono-nerd-font"         # Zed editor font with icons
